{ "name": "form-submission",
  "mixes": [],
  "labels":
    [ "new" ],
  "location":
    { "lineno": 1,
      "filename": "submission-index.js" },
  "docs":
    { "summary": "The WixForms Submissions SPI.",
      "description":
        [ "The Form Submission SPI [custom extension](https://support.wix.com/en/article/velo-custom-app-extensions-using-spis) allows site owners and collaborators to validate a site visitor's filled form. For example, you can validate whether a correct email is entered into the field.",
          "Site owners and collaborators can either write their own custom validation logic, or integrate with a 3rd-party validations provider.",
          "",
          "WixForms calls [`validateSubmission()`](https://www.wix.com/velo/reference/spis/wix-ecom/ecom-validations/getvalidationviolations) to retrieve any violations in a site visitor's cart and checkout.",
          "The custom validation extension code validates the request, and returns any validation violation data in a site visitor's cart and checkout (using the structure provided by Wix eCommerce).",
          "If there aren't any validation violations, the endpoint should return an object containing an empty array. Site visitors can see validation violations in their cart and checkout pages. For example, see the images below:",
          "",
          "The image below shows a cart page with both a general validation violation warning and a line item validation violation warning.",
          "",
          "",
          "The image below shows a checkout page with both a general validation violation error and a line item validation violation error.",
          "",
          "",
          "For a step-by-step tutorial, see [Validation Violations SPI custom extension](https://support.wix.com/en/article/tutorial-validations-custom-extension). ",
          "",
          "Future functionality includes validating products and orders.",
          "",
          "## Before you begin",
          "",
          "By default, the Validations SPI only validates a site visitor's checkout. If you want to also validate a site visitor's cart, set the `validateInCart` parameter to `true` in the custom extension's config file.  ",
          "",
          "## Configuration",
          "",
          "To use the Validations SPI, set up the custom extension's config file with the following parameter:",
          "",
          "  | Name | Type | Description |",
          "  | --- | --- | --- |",
          "  | `validateInCart`|boolean|Whether to validate the cart page in addition to the checkout page. Default: `false` | ",
          "",
          "## Use Cases",
          "",
          "With the Validations SPI you can define the validations for a cart and checkout that fit your site's needs. Possible validations include:",
          " + Minimum subtotal amount to qualify for free shipping.",
          " + Age of a customer before they proceed to checkout.",
          " + Specific items to ship only to specific regions.",
          " + Restrict purchases to site members only.",
          " + Close checkout on certain days. ",
          "",
          "## Terminology",
          "",
          "  | Term | Definition |",
          "  | --- | --- |",
          "  | Severity |How severe the violation is. The violations are shown on the cart and checkout pages. A warning is displayed as yellow, and allows a site visitor to proceed with caution. An error is displayed as red, and doesn't allow a site visitor to proceed with the eCommerce flow. | ",
          "  | Subscription Option |A store owner can create [subscriptions](https://support.wix.com/en/article/wix-stores-selling-product-subscriptions) to sell their products on a recurring basis. A line item can be a subscription. |  ",
          "  | Target |Target location on a checkout or cart page where the violation will be displayed. The target violation can either be in a particular `lineItem`, or in an `other` area of the cart or checkout page. |",
          "  | Violations |A list of any validation violations in a site visitor's cart or checkout. |" ],
      "links": [],
      "examples": [],
      "extra":
        {  } },
  "properties": [],
  "operations": [],
  "callbacks": [],
  "messages": [],
  "extra":
    { "customLabels":
        [ { "id": "maturity-beta" } ] } }